trunk/projects/alpine/prototype/M32/test/java/files/alpine/soap/valid/wsa/wsa-message-complex-epr.xml

<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <S:Header>
    <wsa:MessageID>http://example.com/someuniquestring</wsa:MessageID>
    <wsa:ReplyTo
          xmlns:wsa="http://www.w3.org/2005/08/addressing"
          xmlns:wsaw="http://www.w3.org/2005/03/addressing/wsdl"
          xmlns:fabrikam="http://example.com/fabrikam"
          xmlns:wsdli="http://www.w3.org/2005/08/wsdl-instance"
          wsdli:wsdlLocation="http://example.com/fabrikam
       http://example.com/fabrikam/fabrikam.wsdl">
        <wsa:Address>http://example.com/fabrikam/acct</wsa:Address>
        <wsa:Metadata>
          <wsaw:InterfaceName>fabrikam:Inventory</wsaw:InterfaceName>
        </wsa:Metadata>
        <wsa:ReferenceParameters>
          <fabrikam:CustomerKey>123456789</fabrikam:CustomerKey>
          <fabrikam:ShoppingCart>ABCDEFG</fabrikam:ShoppingCart>
        </wsa:ReferenceParameters>
    </wsa:ReplyTo>
    <wsa:To>mailto:fabrikam@example.com</wsa:To>
    <wsa:Action>http://example.com/fabrikam/mail/Delete</wsa:Action>
  </S:Header>
  <S:Body>
    <f:validate xmlns:f="http://example.com/fabrikam">
      <wsa:EndpointReference
          xmlns:wsa="http://www.w3.org/2005/08/addressing"
          xmlns:wsaw="http://www.w3.org/2005/03/addressing/wsdl"
          xmlns:fabrikam="http://example.com/fabrikam"
          xmlns:wsdli="http://www.w3.org/2005/08/wsdl-instance"
          wsdli:wsdlLocation="http://example.com/fabrikam
       http://example.com/fabrikam/fabrikam.wsdl">
        <wsa:Address>http://example.com/fabrikam/acct</wsa:Address>
        <wsa:Metadata>
          <wsaw:InterfaceName>fabrikam:Inventory</wsaw:InterfaceName>
        </wsa:Metadata>
        <wsa:ReferenceParameters>
          <fabrikam:CustomerKey>123456789</fabrikam:CustomerKey>
          <fabrikam:ShoppingCart>ABCDEFG</fabrikam:ShoppingCart>
        </wsa:ReferenceParameters>
      </wsa:EndpointReference>
    </f:validate>
  </S:Body>
</S:Envelope>